---
type: StructuralSectionGeneralLZ
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralSectionGeneralLZ

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralLZ | 2018 | `public StructuralSectionGeneralLZ ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double bottomFlangeLength , double lipLength , double centroidHorizontal ` |
| Property | BottomFlangeLength | 2018 | `public double BottomFlangeLength { get ; set ; }` |
| Property | LipLength | 2018 | `public double LipLength { get ; set ; }` |